In [1]:
import pandas as pd
import numpy as np

In [2]:
# series - 1 dim array of labeled data
pd.Series(['a', 'b','c'])

0    a
1    b
2    c
dtype: object

In [3]:
df = pd.DataFrame ({
    'Name': ['yossi', 'anna', 'alexey'],
    'color':['red', 'blue', 'yellow'],
    'random':[10.0, np.nan, np.nan]
})

In [4]:
df

     Name   color  random
0   yossi     red    10.0
1    anna    blue     NaN
2  alexey  yellow     NaN

In [5]:
df['random']

0    10.0
1     NaN
2     NaN
Name: random, dtype: float64

In [6]:
#CSV file, comma separated vales
df.to_csv('data.csv', index =False)

In [7]:
series = pd.Series([20, 30, 15, 10], index=["apples", "bananas", "cherries", "Dates"])
df = pd.DataFrame(series)
print(df)

           0
apples    20
bananas   30
cherries  15
Dates     10

In [8]:
# Create a dictionary with the fruit data
fruit_names = ['Apple', 'Banana', 'Cherry', 'Date']
quantities = [150, 200, 50, 100]
colors = ['Red', 'Yellow', 'Red', 'Brown']
price_per_kg= [3, 2, 4, 5]


my_df = pd.DataFrame({
    'Quantity': quantities,
    'Color': colors,
    'Price_per_kg': price_per_kg    
}, index = fruit_names)

my_df
# # Save the DataFrame to a CSV file
# csv_filename = 'store_1_stock.csv'
# df.to_csv(csv_filename, index=False)
# print(f"DataFrame saved to {csv_filename}")

        Quantity   Color  Price_per_kg
Apple        150     Red             3
Banana       200  Yellow             2
Cherry        50     Red             4
Date         100   Brown             5

In [9]:
my_df.loc['Apple']

Quantity        150
Color           Red
Price_per_kg      3
Name: Apple, dtype: object

In [10]:
my_df.iloc[1]

Quantity           200
Color           Yellow
Price_per_kg         2
Name: Banana, dtype: object

In [11]:
my_df.to_csv('my_df.csv')

In [12]:
df = pd.read_csv('my_df.csv', index_col=0)
print(df)

        Quantity   Color  Price_per_kg
Apple        150     Red             3
Banana       200  Yellow             2
Cherry        50     Red             4
Date         100   Brown             5

In [13]:
df.head(2) # first 2 rows

        Quantity   Color  Price_per_kg
Apple        150     Red             3
Banana       200  Yellow             2

In [14]:
df.tail(1) #last rows

      Quantity  Color  Price_per_kg
Date       100  Brown             5

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Apple to Date
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Quantity      4 non-null      int64
 1   Color         4 non-null      object
 2   Price_per_kg  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 128.0+ bytes

In [16]:
df.describe()

         Quantity  Price_per_kg
count    4.000000      4.000000
mean   125.000000      3.500000
std     64.549722      1.290994
min     50.000000      2.000000
25%     87.500000      2.750000
50%    125.000000      3.500000
75%    162.500000      4.250000
max    200.000000      5.000000

In [17]:
# slicing
df[0:3]

        Quantity   Color  Price_per_kg
Apple        150     Red             3
Banana       200  Yellow             2
Cherry        50     Red             4

In [18]:
df[0:3]['Price_per_kg']

Apple     3
Banana    2
Cherry    4
Name: Price_per_kg, dtype: int64

In [19]:
# ADDING RENAMING REMOVING
df['Country']=['USA', 'USA', 'USA', 'Canada']

In [20]:
df

        Quantity   Color  Price_per_kg Country
Apple        150     Red             3     USA
Banana       200  Yellow             2     USA
Cherry        50     Red             4     USA
Date         100   Brown             5  Canada

In [21]:
df.rename(columns={'Price_per_kg': 'Price'}, inplace=True)

In [22]:
df

        Quantity   Color  Price Country
Apple        150     Red      3     USA
Banana       200  Yellow      2     USA
Cherry        50     Red      4     USA
Date         100   Brown      5  Canada

In [23]:
df.drop('Country', axis=1, inplace=True)

In [24]:
df

        Quantity   Color  Price
Apple        150     Red      3
Banana       200  Yellow      2
Cherry        50     Red      4
Date         100   Brown      5

In [25]:
# changing data inside columns
df['Quantity'] * 2

Apple     300
Banana    400
Cherry    100
Date      200
Name: Quantity, dtype: int64

In [26]:
df['Quantity']=  df['Quantity'] * 2

In [27]:
df

        Quantity   Color  Price
Apple        300     Red      3
Banana       400  Yellow      2
Cherry       100     Red      4
Date         200   Brown      5

In [28]:
df.isna()

        Quantity  Color  Price
Apple      False  False  False
Banana     False  False  False
Cherry     False  False  False
Date       False  False  False

In [29]:
df[df.iloc[0]['Color']] = np.nan

In [30]:
df

        Quantity   Color  Price  Red
Apple        300     Red      3  NaN
Banana       400  Yellow      2  NaN
Cherry       100     Red      4  NaN
Date         200   Brown      5  NaN

In [31]:
#DATA CONVERSION
df['Quantity'] =df['Quantity'].astype('float16')

In [32]:
df['Quantity']

Apple     300.0
Banana    400.0
Cherry    100.0
Date      200.0
Name: Quantity, dtype: float16

In [33]:
df.min()

Quantity    100.0
Color       Brown
Price           2
Red           NaN
dtype: object

In [34]:
df.max()

Quantity     400.0
Color       Yellow
Price            5
Red            NaN
dtype: object

In [35]:
df['Score'] = [85, 63, 77, 96]

In [36]:
df

        Quantity   Color  Price  Red  Score
Apple      300.0     Red      3  NaN     85
Banana     400.0  Yellow      2  NaN     63
Cherry     100.0     Red      4  NaN     77
Date       200.0   Brown      5  NaN     96

In [37]:
df.drop('Score', axis=1,inplace = True)

In [38]:
df

        Quantity   Color  Price  Red
Apple      300.0     Red      3  NaN
Banana     400.0  Yellow      2  NaN
Cherry     100.0     Red      4  NaN
Date       200.0   Brown      5  NaN

In [39]:
df.drop('Red', axis=1,inplace = True)

In [40]:
df

        Quantity   Color  Price
Apple      300.0     Red      3
Banana     400.0  Yellow      2
Cherry     100.0     Red      4
Date       200.0   Brown      5

In [41]:
df['Quantity'].sum()

1000.0

In [42]:
df.nlargest(3,'Price')

        Quantity  Color  Price
Date       200.0  Brown      5
Cherry     100.0    Red      4
Apple      300.0    Red      3

In [43]:
df.loc['Banana']

Quantity     400.0
Color       Yellow
Price            2
Name: Banana, dtype: object

In [44]:
df.iloc[1]

Quantity     400.0
Color       Yellow
Price            2
Name: Banana, dtype: object

In [45]:
df['Sale_Price'] = df['Price'] * 0.9

In [46]:
df.rename(columns={'Price': 'Original_Price'}, inplace=True)

df.drop(columns=['Color'], inplace=True)

In [51]:
df

        Quantity  Original_Price  Sale_Price
Apple      300.0               3         2.7
Banana     400.0               2         1.8
Cherry     100.0               4         3.6
Date       200.0               5         4.5

In [54]:
new_data = pd.DataFrame({"Fruit": ["Grapes"], "Quantity": [np.nan], "Original_Price": [3.5], "Sale_Price": [3.5 * 0.9]})

In [55]:
new_data.set_index('Fruit',inplace=True)

In [56]:
df = pd.concat([df, new_data]) # pd.concat adds a new row

In [57]:
df

        Quantity  Original_Price  Sale_Price
Apple      300.0             3.0        2.70
Banana     400.0             2.0        1.80
Cherry     100.0             4.0        3.60
Date       200.0             5.0        4.50
Grapes       NaN             3.5        3.15

In [58]:
df['Quantity'].dtype

dtype('float16')

In [63]:
# df['Quantity'] = df['Quantity'].astype(int) if there are not NAN

In [64]:
df['Quantity'].sum()

1000.0

In [66]:
df.nlargest(1,'Original_Price')

      Quantity  Original_Price  Sale_Price
Date     200.0             5.0         4.5

In [67]:
df['Quantity'].idxmin()

'Cherry'

In [68]:
df['Quantity'].idxmax()

'Banana'